class Common_stopwords:

    def stop_words_region(self):
        stop_words = ['강원', '경기', '경남', '경북', '대구', '대전', '부산', '서울', '울산', '인천', '전남',' 전북', '제주, 충남', '충북']
        # stop_words = ['강원', '경기', '경남', '경북', '대구', '대전', '부산', '서울', '울산', '인천', '전남',' 전북', '제주, 충남', '충북'
        #               '수원', '성남', '안양', '안산', '용인', '광명', '평택', '과천', '오산', '시흥','군포','의왕', '하남', '이천', '하남',
        #               '안성', '김포', '화성', '광주', '여주', '부천', '고양', '의정부', '구리', '남양주', '파주', '양주', '포천', '연천'
        #               '가평', '춘천', '원주', '강릉', '동해', '태백', '속초', '삼척', '홍천', '횡성', '영월', '평창', '정선', '철원',
        #               '화천', '양구', '인제', '고성', '양양', '청주', '자치', '충주', '제천', '보은', '옥천', '영동', '진천', '괴산', '음성',
        #               '단양', '증평', '천안', '공주', '보령', '아산', '서산', '논산', '계룡', '당진', '금산', '부여', '서천', '청양', '홍성',
        #               '예산', '태안', '전주', '익산', '정읍', '남원', '김제', '완주', '진안', '무주', '장수', '순창',
        #               '고창', '부안', '목포', '여수', '순천', '나주', '광양', '담양', '곡성', '구례', '고흥', '보성', '화순', '장흥', '강진',
        #               '해남', '영암', '무안', '함평', '영광', '장성', '완도', '진도', '포항', '자치', '경주', '김천', '안동', '구미', '영주',
        #               '영천', '상주', '문경', '경산', '의성', '청송', '영양', '영덕', '청도', '고령', '성주', '칠곡', '예천', '봉화', '울진',
        #               '울릉', '창원', '진주', '통영', '사천', '김해', '밀양', '거제', '양산', '의령', '함안', '창녕', '고성', '남해', '하동',
        #               '산청', '함양', '거창', '합천']
        return stop_words

    def stop_words_another(self):
        stop_words = ['축제', '행사', '문화', '프로그램', '참여', '올해', '이번', '시간', '시민', '에디터', '사진', '오늘', '사람', '지역',
                      '시작', '장소', '여기', '우리', '지금', '하나', '생각', '정말', '바로', '블로그', '페스티벌', '이용', '기간', '업체',
                      '홈페이지', '구경', '보고', '다시', '기록', '참고', '가격', '느낌', '준비', '네이버', '한번', '저희', '낚시', '호텔',
                      '방문', '자리', '하루', '먼저', '다른', '정도']
        return stop_words